# Importar Librerías

In [1]:
import sqlalchemy
from sqlalchemy import create_engine
from sqlalchemy import Table, Column, Integer, String, MetaData, ForeignKey
from sqlalchemy import inspect

# Crear Base de Datos

In [2]:
import sqlite3
conexion = sqlite3.connect("chinook_multidimensional.db")

# Crear Dimensiones

In [3]:
# DIMENSIÓN dim_albums
try:
    conexion.execute("""CREATE TABLE dim_albums (
    AlbumId  INTEGER        PRIMARY KEY AUTOINCREMENT NOT NULL,
    Title    NVARCHAR (160) NOT NULL
    )""")
    print ("Dimensión dim_albums creada exitosamente.")
except sqlite3.OperationalError:
    print ("Dimensión dim_albums ya existe en la base de datos.")

Dimensión dim_albums creada exitosamente.

In [4]:
# DIMENSIÓN dim_artists
try:
    conexion.execute("""CREATE TABLE dim_artists (
    ArtistId INTEGER        PRIMARY KEY AUTOINCREMENT NOT NULL,
    Name     NVARCHAR (120)
    )""")
    print ("Dimensión dim_artists creada exitosamente.")
except sqlite3.OperationalError:
    print ("Dimensión dim_artists ya existe en la base de datos.")

Dimensión dim_artists creada exitosamente.

In [5]:
# DIMENSIÓN dim_customers
try:
    conexion.execute("""CREATE TABLE dim_customers (
    CustomerId   INTEGER       PRIMARY KEY AUTOINCREMENT NOT NULL,
    FirstName    NVARCHAR (40) NOT NULL,
    LastName     NVARCHAR (20) NOT NULL,
    Company      NVARCHAR (80),
    Address      NVARCHAR (70),
    City         NVARCHAR (40),
    State        NVARCHAR (40),
    Country      NVARCHAR (40),
    PostalCode   NVARCHAR (10),
    Phone        NVARCHAR (24),
    Fax          NVARCHAR (24),
    Email        NVARCHAR (60) NOT NULL,
    SupportRepId INTEGER       NOT NULL REFERENCES dim_employees (EmployeeId)
    );""")
    print ("Tabla dim_customers creada exitosamente.")
except sqlite3.OperationalError:
    print ("Tabla dim_customers ya existe en la base de datos.")

Tabla dim_customers creada exitosamente.

In [6]:
# DIMENSIÓN dim_employees
try:
    conexion.execute("""CREATE TABLE dim_employees (
    EmployeeId INTEGER       PRIMARY KEY AUTOINCREMENT NOT NULL,
    LastName   NVARCHAR (20) NOT NULL,
    FirstName  NVARCHAR (20) NOT NULL,
    Title      NVARCHAR (30),
    ReportsTo  INTEGER       REFERENCES dim_employees (EmployeeId),
    BirthDate  DATETIME,
    HireDate   DATETIME,
    Address    NVARCHAR (70),
    City       NVARCHAR (40),
    State      NVARCHAR (40),
    Country    NVARCHAR (40),
    PostalCode NVARCHAR (10),
    Phone      NVARCHAR (24),
    Fax        NVARCHAR (24),
    Email      NVARCHAR (60) 
    );""")
    print ("Tabla dim_employees creada exitosamente.")
except sqlite3.OperationalError:
    print ("Tabla dim_employees ya existe en la base de datos.")

Tabla dim_employees creada exitosamente.

In [7]:
# DIMENSIÓN dim_genres
try:
    conexion.execute("""CREATE TABLE dim_genres (
    GenreId INTEGER        PRIMARY KEY AUTOINCREMENT NOT NULL,
    Name    NVARCHAR (120) 
    )""")
    print ("Tabla dim_genres creada exitosamente.")
except sqlite3.OperationalError:
    print ("Tabla dim_genres ya existe en la base de datos.")

Tabla dim_genres creada exitosamente.

In [8]:
# DIMENSIÓN dim_invoices
try:
    conexion.execute("""CREATE TABLE dim_invoices (
    InvoiceId INTEGER         PRIMARY KEY AUTOINCREMENT,
    Total     NUMERIC (10, 2) NOT NULL
    )""")
    print ("Tabla dim_invoices creada exitosamente.")
except sqlite3.OperationalError:
    print ("Tabla dim_invoices ya existe en la base de datos.")

Tabla dim_invoices creada exitosamente.

In [9]:
# DIMENSIÓN dim_media_types
try:
    conexion.execute("""CREATE TABLE dim_media_types (
    MediaTypeId INTEGER        PRIMARY KEY AUTOINCREMENT NOT NULL,
    Name        NVARCHAR (120) 
    )""")
    print ("Tabla dim_media_types creada exitosamente.")
except sqlite3.OperationalError:
    print ("Tabla dim_media_types ya existe en la base de datos.")

Tabla dim_media_types creada exitosamente.

In [10]:
# DIMENSIÓN dim_tracks
try:
    conexion.execute("""CREATE TABLE dim_tracks (
    TrackId      INTEGER         PRIMARY KEY AUTOINCREMENT NOT NULL,
    Name         NVARCHAR (200)  NOT NULL,
    MediaTypeId  INTEGER         NOT NULL REFERENCES dim_media_types (MediaTypeId),
    GenreId      INTEGER         REFERENCES dim_genres (GenreId),
    Composer     NVARCHAR (220),
    Milliseconds INTEGER         NOT NULL,
    Bytes        INTEGER,
    UnitPrice    NUMERIC (10, 2) NOT NULL
    )""")
    print ("Tabla dim_tracks creada exitosamente.")
except sqlite3.OperationalError:
    print ("Tabla dim_tracks ya existe en la base de datos.")

Tabla dim_tracks creada exitosamente.

In [11]:
# DIMENSIÓN dim_playlists
try:
    conexion.execute("""CREATE TABLE dim_playlists (
    PlaylistId INTEGER        PRIMARY KEY AUTOINCREMENT NOT NULL,
    Name       NVARCHAR (120) 
    )""")
    print ("Tabla dim_playlists creada exitosamente.")
except sqlite3.OperationalError:
    print ("Tabla dim_playlists ya existe en la base de datos.")

Tabla dim_playlists creada exitosamente.

In [12]:
# DIMENSIÓN dim_location
try:
    conexion.execute("""CREATE TABLE dim_location (
    LocationId        INTEGER      PRIMARY KEY AUTOINCREMENT NOT NULL,
    BillingAddress    VARCHAR (70),
    BillingCity       VARCHAR (40),
    BillingState      VARCHAR (40),
    BillingCountry    VARCHAR (40),
    BillingPostalCode VARCHAR (10) 
    )""")
    print ("Tabla dim_location creada exitosamente.")
except sqlite3.OperationalError:
    print ("Tabla dim_location ya existe en la base de datos.")

Tabla dim_location creada exitosamente.

In [13]:
# DIMENSIÓN dim_time
try:
    conexion.execute("""CREATE TABLE dim_time( 
    TimeId      INTEGER     PRIMARY KEY AUTOINCREMENT NOT NULL,
    Year        INTEGER     NOT NULL, 
    Quarter     INTEGER     NOT NULL, 
    Month       INTEGER     NOT NULL, 
    Week        INTEGER     NOT NULL, 
    Day         INTEGER     NOT NULL, 
    WeekDay     INTEGER     NOT NULL, 
    Month_Name  VARCHAR(15) NOT NULL,   
    Day_Name    VARCHAR(6)  NOT NULL
    )""")
    print ("Tabla dim_time creada exitosamente.")
except sqlite3.OperationalError:
    print ("Tabla dim_time ya existe en la base de datos.")

Tabla dim_time creada exitosamente.

In [14]:
# TABLA DE HECHOS fact_invoice_items
try:
    conexion.execute("""CREATE TABLE fact_invoice_items (
    Id         INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
    InvoiceID  INTEGER REFERENCES dim_invoices (InvoiceId) NOT NULL,
    CustomerID INTEGER REFERENCES dim_customers (CustomerId) NOT NULL,
    TracksID   INTEGER REFERENCES dim_tracks (TrackId) NOT NULL,
    TimeID     INTEGER REFERENCES dim_time (TimeId) NOT NULL,
    LocationID INTEGER REFERENCES dim_location (LocationId) NOT NULL,
    PlaylistID INTEGER REFERENCES dim_playlists (PlaylistId) NOT NULL,
    ArtistID   INTEGER REFERENCES dim_artists (ArtistId) NOT NULL,
    AlbumID    INTEGER REFERENCES dim_albums (AlbumId) NOT NULL,
    Quantity   INTEGER NOT NULL
    )""")
    print ("Tabla fact_invoice_items creada exitosamente.")
except sqlite3.OperationalError:
    print ("Tabla fact_invoice_items ya existe en la base de datos.")

Tabla fact_invoice_items creada exitosamente.

# Conexión a las bases de datos

In [15]:
# Conexión a la base de datos transalacional
engine = create_engine('sqlite:///chinook.db')
engine

Engine(sqlite:///chinook.db)

In [16]:
# Conexión a la base de datos Multidimensional
engineMM = create_engine('sqlite:///chinook_multidimensional.db')
engineMM

Engine(sqlite:///chinook_multidimensional.db)

# Extract

In [17]:
metadata = MetaData()

metadata.create_all(engine)
metadata.create_all(engineMM)

inspector = inspect(engine)
inspectorWH = inspect(engineMM)

In [18]:
# OBTENER DATOS
inspector.get_columns('employees')
inspector.get_columns('albums')
inspector.get_columns('media_types')
inspector.get_columns('genres')
inspector.get_columns('playlists')
inspector.get_columns('artists')
inspector.get_columns('invoices')
inspector.get_columns('customers')
inspector.get_columns('tracks')

[{'name': 'TrackId',
  'type': INTEGER(),
  'nullable': False,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 1},
 {'name': 'Name',
  'type': NVARCHAR(length=200),
  'nullable': False,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0},
 {'name': 'AlbumId',
  'type': INTEGER(),
  'nullable': True,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0},
 {'name': 'MediaTypeId',
  'type': INTEGER(),
  'nullable': False,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0},
 {'name': 'GenreId',
  'type': INTEGER(),
  'nullable': True,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0},
 {'name': 'Composer',
  'type': NVARCHAR(length=220),
  'nullable': True,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0},
 {'name': 'Milliseconds',
  'type': INTEGER(),
  'nullable': False,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0},
 {'name': 'Bytes',
  'type': INTEGER(),
  'nullable': True,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0},
 {'name': 'UnitPrice',
  'type': NUMERIC(precision=10, scale=2),
  'nullable': False,
  'default': None,
  'autoincrement': 'auto',
  'primary_key': 0}]

# Transform

In [21]:
import pandas as pd

### Tabla albums

In [19]:
df_albums=pd.read_sql_query("""SELECT AlbumId, Title
FROM albums;""", con=engine.connect())
df_albums.head()

   AlbumId                                  Title
0        1  For Those About To Rock We Salute You
1        2                      Balls to the Wall
2        3                      Restless and Wild
3        4                      Let There Be Rock
4        5                               Big Ones

### Tabla artists

In [20]:
df_artists=pd.read_sql_query("""SELECT ArtistID, Name
FROM artists;""", con=engine.connect())
df_artists.head()

   ArtistId               Name
0         1              AC/DC
1         2             Accept
2         3          Aerosmith
3         4  Alanis Morissette
4         5    Alice In Chains

### Tabla customers

In [22]:
df_customers=pd.read_sql_query("""SELECT CustomerId,Firstname,LastName,
Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
FROM customers;""", con=engine.connect())
df_customers.head()

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
1,2,Leonie,Köhler,NA,Theodor-Heuss-Straße 34,Stuttgart,NA,Germany,70174,+49 0711 2842222,NA,leonekohler@surfeu.de,5
2,3,François,Tremblay,NA,1498 rue Bélanger,Montréal,QC,Canada,H2G 1A7,+1 (514) 721-4711,NA,ftremblay@gmail.com,3
3,4,Bjørn,Hansen,NA,Ullevålsveien 14,Oslo,NA,Norway,0171,+47 22 44 22 22,NA,bjorn.hansen@yahoo.no,4
4,5,František,Wichterlová,JetBrains s.r.o.,Klanova 9/506,Prague,NA,Czech Republic,14700,+420 2 4172 5555,+420 2 4172 5555,frantisekw@jetbrains.com,4

### Tabla employees

In [23]:
df_employees=pd.read_sql_query("""SELECT EmployeeId, LastName, 
FirstName, Title, ReportsTo, BirthDate, HireDate, Address, 
City, State, Country, PostalCode, Phone, Fax, Email
FROM employees;""", con=engine.connect())
df_employees.head()

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

### Tabla genre

In [24]:
df_genres=pd.read_sql_query("""SELECT GenreID, Name
FROM genres;""", con=engine.connect())
df_genres.head()

   GenreId                Name
0        1                Rock
1        2                Jazz
2        3               Metal
3        4  Alternative & Punk
4        5       Rock And Roll

### Tabla invoices

In [25]:
df_invoices=pd.read_sql_query("""SELECT InvoiceID, Total
FROM invoices;""", con=engine.connect())
df_invoices.head()

   InvoiceId  Total
0          1   1.98
1          2   3.96
2          3   5.94
3          4   8.91
4          5  13.86

### Tabla media_types

In [26]:
df_mediatypes=pd.read_sql_query("""SELECT MediaTypeID, Name
FROM media_types;""", con=engine.connect())
df_mediatypes.head()

   MediaTypeId                         Name
0            1              MPEG audio file
1            2     Protected AAC audio file
2            3  Protected MPEG-4 video file
3            4     Purchased AAC audio file
4            5               AAC audio file

### Tabla tracks

In [27]:
df_tracks=pd.read_sql_query("""SELECT TrackId,Name,MediaTypeID,
GenreId,Composer,Milliseconds,Bytes,UnitPrice
FROM tracks;""", con=engine.connect())
df_tracks.head()

,TrackId,Name,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice
0,1,For Those About To Rock (We Salute You),1,1,"Angus Young, Malcolm Young, Brian Johnson",343719,11170334,0.99
1,2,Balls to the Wall,2,1,NA,342562,5510424,0.99
2,3,Fast As a Shark,2,1,"F. Baltes, S. Kaufman, U. Dirkscneider & W. Ho...",230619,3990994,0.99
3,4,Restless and Wild,2,1,"F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. D...",252051,4331779,0.99
4,5,Princess of the Dawn,2,1,Deaffy & R.A. Smith-Diesel,375418,6290521,0.99

### Tabla playlists

In [28]:
df_playlists=pd.read_sql_query("""SELECT PlaylistID, Name
FROM playlists;""", con=engine.connect())
df_playlists.head()

   PlaylistId        Name
0           1       Music
1           2      Movies
2           3    TV Shows
3           4  Audiobooks
4           5  90’s Music

### Tabla location

In [29]:
df_location=pd.read_sql_query("""SELECT BillingAddress, BillingCity, 
BillingState, BillingCountry, BillingPostalCode
FROM invoices;""", con=engine.connect())
df_location.head()

,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode
0,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174
1,Ullevålsveien 14,Oslo,None,Norway,0171
2,Grétrystraat 63,Brussels,None,Belgium,1000
3,8210 111 ST NW,Edmonton,AB,Canada,T6G 2C7
4,69 Salem Street,Boston,MA,USA,2113

### Tabla time

In [31]:
from datetime import datetime, date, timedelta

Date=pd.date_range('2009-01-01','2013-12-22',freq='D').to_series()
date1=pd.to_datetime(Date)
Year=date1.dt.year
Quarter=date1.dt.quarter
Month=date1.dt.month
Week=date1.dt.isocalendar().week
Day=date1.dt.day
WeekDay=date1.dt.weekday
Month_Name=date1.dt.month_name()
Day_Name=date1.dt.day_name()

DateconDate=pd.to_datetime(Date, format = '%d-%m-%Y')
df_time=pd.DataFrame({'Year':list(Year), 'Quarter':list(Quarter), 
'Month':list(Month), 'Week':list(Week), 'Day':list(Day), 
'WeekDay':list(WeekDay), 'Month_Name':list(Month_Name), 
'Day_Name':list(Day_Name)})
df_time.head()

   Year  Quarter  Month  Week  Day  WeekDay Month_Name  Day_Name
0  2009        1      1     1    1        3    January  Thursday
1  2009        1      1     1    2        4    January    Friday
2  2009        1      1     1    3        5    January  Saturday
3  2009        1      1     1    4        6    January    Sunday
4  2009        1      1     2    5        0    January    Monday

# Load

## Funciones para la carga

In [32]:
def updateData(name_table,data_db,name_columns):
	print(name_columns)
	aux_values='?'
	aux_data=[]
	aux_columns=name_columns[0]
	aux_data.append(list(data_db[name_columns[0]]))
	entities=[]
	aux_entities=[]
	for i in range(len(name_columns)-1):
		aux_values+=',?'
		aux_columns+=','+name_columns[i+1]
		aux_data.append(list(data_db[name_columns[i+1]]))
	for i in range(len(aux_data[0])):
		#aux_entities.append(i)
		for j in range(len(aux_data)):
			aux_entities.append(aux_data[j][i])
		entities.append(aux_entities)
		aux_entities=[]
	with engineMM.connect() as con:
		for i in entities:
			con.execute('INSERT INTO '+name_table+'('+aux_columns+') VALUES('+aux_values+')', i)

### dim_albums

In [33]:
updateData('dim_albums',df_albums,list(df_albums.columns.values))

['AlbumId', 'Title']

### dim_artists

In [34]:
updateData('dim_artists',df_artists,list(df_artists.columns.values))

['ArtistId', 'Name']

### dim_customers

In [35]:
updateData('dim_customers',df_customers,list(df_customers.columns.values))

['CustomerId', 'FirstName', 'LastName', 'Company', 'Address', 'City', 'State', 'Country', 'PostalCode', 'Phone', 'Fax', 'Email', 'SupportRepId']

### dim_employees

In [36]:
updateData('dim_employees',df_employees,list(df_employees.columns.values))

['EmployeeId', 'LastName', 'FirstName', 'Title', 'ReportsTo', 'BirthDate', 'HireDate', 'Address', 'City', 'State', 'Country', 'PostalCode', 'Phone', 'Fax', 'Email']

### dim_genres

In [37]:
updateData('dim_genres',df_genres,list(df_genres.columns.values))

['GenreId', 'Name']

### dim_invoices

In [38]:
updateData('dim_invoices',df_invoices,list(df_invoices.columns.values))

['InvoiceId', 'Total']

### dim_media_types

In [39]:
updateData('dim_media_types',df_mediatypes,list(df_mediatypes.columns.values))

['MediaTypeId', 'Name']

### dim_tracks

In [40]:
updateData('dim_tracks',df_tracks,list(df_tracks.columns.values))

['TrackId', 'Name', 'MediaTypeId', 'GenreId', 'Composer', 'Milliseconds', 'Bytes', 'UnitPrice']

### dim_playlists

In [41]:
updateData('dim_playlists',df_playlists,list(df_playlists.columns.values))

['PlaylistId', 'Name']

### dim_location

In [42]:
updateData('dim_location',df_location,list(df_location.columns.values))

['BillingAddress', 'BillingCity', 'BillingState', 'BillingCountry', 'BillingPostalCode']

### dim_time

In [43]:
updateData('dim_time',df_time,list(df_time.columns.values))

['Year', 'Quarter', 'Month', 'Week', 'Day', 'WeekDay', 'Month_Name', 'Day_Name']

# Tabla de Hechos fact_invoice_items

In [44]:
df_AuxInvoiceId=pd.read_sql_query("""SELECT InvoiceId
FROM invoice_items;""", con=engine.connect())
df_AuxInvoiceId.head()

df_CustInv=pd.read_sql_query("""SELECT InvoiceId, CustomerId
FROM invoices;""", con=engine.connect())

aux=list(df_AuxInvoiceId['InvoiceId'])
auxCustomer=[]
for i in aux:
    aux2=df_CustInv.index[df_CustInv['InvoiceId'] == i].tolist()
    auxCustomer.append(df_CustInv['CustomerId'][aux2[0]])

df_dim_time=pd.read_sql_query("""SELECT TimeId
FROM dim_time;""", con=engineMM.connect())
auxTime=[]

df_locationInv=pd.read_sql_query("""SELECT InvoiceId, BillingAddress
FROM invoices;""", con=engine.connect())
aux=list(df_AuxInvoiceId['InvoiceId'])
auxTime1=[]
for i in aux:
    aux22=df_locationInv.index[df_locationInv['InvoiceId'] == i].tolist()
    auxTime1.append(df_locationInv['BillingAddress'][aux22[0]])
df_dim_location=pd.read_sql_query("""SELECT LocationId, BillingAddress
FROM dim_location;""", con=engineMM.connect())
auxLocation=[]
for i in auxTime1:
    aux22=df_dim_location.index[df_dim_location['BillingAddress'] == i].tolist()
    auxLocation.append(df_dim_location['LocationId'][aux22[0]])

df_AuxTrackId=pd.read_sql_query("""SELECT TrackId
FROM invoice_items;""", con=engine.connect())
df_AuxTrackId.head()

df_tracksP=pd.read_sql_query("""SELECT TrackId, AlbumId
FROM tracks;""", con=engine.connect())
df_album=pd.read_sql_query("""SELECT AlbumId, Title, ArtistId
FROM albums;""", con=engine.connect())
aux=list(df_AuxTrackId['TrackId'])
auxAlbum=[]
for i in aux:
    aux22=df_tracksP.index[df_tracksP['TrackId'] == i].tolist()
    auxAlbum.append(df_tracksP['AlbumId'][aux22[0]])


df_tracksPlay=pd.read_sql_query("""SELECT PlaylistId, TrackId
FROM playlist_track;""", con=engine.connect())
aux=list(df_AuxTrackId['TrackId'])
auxPlaylist=[]
for i in aux:
    aux22=df_tracksPlay.index[df_tracksPlay['TrackId'] == i].tolist()
    auxPlaylist.append(df_tracksPlay['PlaylistId'][aux22[0]])    

    
    df_tracksPlay=pd.read_sql_query("""SELECT PlaylistId, TrackId
FROM playlist_track;""", con=engine.connect())
aux=list(df_AuxTrackId['TrackId'])
auxArtist=[]
for i in auxAlbum:
    aux22=df_album.index[df_album['AlbumId'] == i].tolist()
    auxArtist.append(df_album['ArtistId'][aux22[0]])

df_Quantity=pd.read_sql_query("""SELECT Quantity
FROM invoice_items;""", con=engine.connect())
df_Quantity.head()

   Quantity
0         1
1         1
2         1
3         1
4         1

# fact_invoice_items

In [45]:
columnas=['InvoiceID','CustomerID','TracksID','TimeID','LocationID','PlaylistID','ArtistID','AlbumID','Quantity']
df = pd.DataFrame(list(zip(list(df_AuxInvoiceId['InvoiceId']),auxCustomer,auxLocation,auxTime,
                          list(df_AuxTrackId['TrackId']),auxPlaylist,auxArtist,auxAlbum,
                           list(df_Quantity['Quantity']))), columns = columnas)
updateData('fact_invoice_items',df,list(df.columns.values))

['InvoiceID', 'CustomerID', 'TracksID', 'TimeID', 'LocationID', 'PlaylistID', 'ArtistID', 'AlbumID', 'Quantity']